Ken930922/RT-Thread/applications/stm32f40x_SWD.c
/**
  ******************************************************************************
  * @file  stm32f40x_swd.C
  * @author  Ken
  * @version  V1.0.0
  * @date  2020-4-28
  * @brief  This file contains all the functions prototypes for the SWD 
  *         firmware library.
  ******************************************************************************
  **/ 

#include "stm32f40x_swd.h"
#include "debug_cm.h"
#define DHCSR 0xE000EDF0 //调试停机控制及状态寄存器    R/W
#define DCRSR 0xE000EDF4 //调试内核寄存器选择者寄存器   W
#define DCRDR 0xE000EDF8 //调试内核寄存器数据寄存器    R/W
#define DEMCR 0xE000EDFC//调试及监视器控制寄存器       R/W
#define MAX_TIMEOUT 1
#define REGWnR (1 << 16)

/* --------------------------------------SWD_BASE--------------------------------- */
SWD_TypeDef_Struct SWD1_BASE, SWD2_BASE;

static void DELAY_US(uint32_t us)
{
    volatile uint32_t i, j;

    for(i = 0; i < us; i++)
    {
        for(j = 0; j < 30U; j++)
        {
            __NOP();
        }
    }
}
/**
  * @brief  Initializes the IO hardware of SWDx.
  * @param SWDx: where x can be  1 to SWD_NUM_USED to select the SWD.
  *        SWD_NUM_USED is defined at stm32f10x_SWD.h, can be 1 to SWD_NUM_MAX, 
	*        and SWD_NUM_MAX is also defined at stm32f10x_SWD.h, can be 1 to 16.
  * @retval :  ERROR or SUCCESS.
  */
void SWD_GPIOConfig(SWD_TypeDef_Struct *SWDx)
{
    GPIO_InitTypeDef GPIO_InitStructure;

	  if(SWDx== NULL)  
			return;	
	
	  /* SWD GPIO Configuration */ 
    if((SWDx->SWD_Hardware.CLK_GPIOx==SWD_GPIONULL)&&  \
			(SWDx->SWD_Hardware.DIO_GPIOx==SWD_GPIONULL) &&  \
			(SWDx->SWD_Hardware.RST_GPIOx==SWD_GPIONULL))		
			return;
	  if((SWDx->SWD_Hardware.CLK_GPIO_Pin==SWD_GPIO_Pin_NULL)&& 	\
			(SWDx->SWD_Hardware.DIO_GPIO_Pin==SWD_GPIO_Pin_NULL) &&  \
			(SWDx->SWD_Hardware.RST_GPIO_Pin==SWD_GPIO_Pin_NULL))		
			return;
	
	  GPIO_InitStructure.Pin = SWDx->SWD_Hardware.CLK_GPIO_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(SWDx->SWD_Hardware.CLK_GPIOx, &GPIO_InitStructure);

		GPIO_InitStructure.Pin = SWDx->SWD_Hardware.DIO_GPIO_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(SWDx->SWD_Hardware.DIO_GPIOx, &GPIO_InitStructure);
		 
		GPIO_InitStructure.Pin = SWDx->SWD_Hardware.RST_GPIO_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(SWDx->SWD_Hardware.RST_GPIOx, &GPIO_InitStructure);
}


/**
  * @brief  swd初始化 硬件
  * @param 	SWDx.
  * @retval :void.
  */
void SWD_Init(SWD_TypeDef_Struct *SWDx,SWD_InitTypeDef_Struct* SWDx_InitStruct)
{
	if(SWDx== NULL)  
		return;	
	if(SWDx == SWD1)
	{
		SWD1_BASE.SWD_Hardware.CLK_GPIOx = SWD1_CLKGPIOx;
		SWD1_BASE.SWD_Hardware.DIO_GPIOx = SWD1_DIOGPIOx;
		SWD1_BASE.SWD_Hardware.RST_GPIOx = SWD1_RSTGPIOx;
		SWD1_BASE.SWD_Hardware.CLK_GPIO_Pin = SWD1_CLKGPIO_Pin;
		SWD1_BASE.SWD_Hardware.DIO_GPIO_Pin = SWD1_DIOGPIO_Pin;
		SWD1_BASE.SWD_Hardware.RST_GPIO_Pin = SWD1_RSTGPIO_Pin;
	}
	else if(SWDx==SWD2)
	{
	  SWD2_BASE.SWD_Hardware.CLK_GPIOx = SWD2_CLKGPIOx;
		SWD2_BASE.SWD_Hardware.DIO_GPIOx = SWD2_DIOGPIOx;
		SWD2_BASE.SWD_Hardware.RST_GPIOx = SWD2_RSTGPIOx;
		SWD2_BASE.SWD_Hardware.CLK_GPIO_Pin = SWD2_CLKGPIO_Pin;
		SWD2_BASE.SWD_Hardware.DIO_GPIO_Pin = SWD2_DIOGPIO_Pin;
		SWD2_BASE.SWD_Hardware.RST_GPIO_Pin = SWD2_RSTGPIO_Pin;
	}	
	SWD_GPIOConfig(SWDx);
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.RST_GPIOx,SWDx->SWD_Hardware.RST_GPIO_Pin,GPIO_PIN_RESET);
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.CLK_GPIOx,SWDx->SWD_Hardware.CLK_GPIO_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.RST_GPIOx,SWDx->SWD_Hardware.RST_GPIO_Pin, GPIO_PIN_SET);
	
	SWDx->SWD_OperatingParameter.init = SWDx_InitStruct->init;
	SWDx->SWD_OperatingParameter.uninit = SWDx_InitStruct->uninit;
	SWDx->SWD_OperatingParameter.erase_chip = SWDx_InitStruct->erase_chip;
	SWDx->SWD_OperatingParameter.erase_sector = SWDx_InitStruct->erase_sector;
	SWDx->SWD_OperatingParameter.program_page = SWDx_InitStruct->program_page;
	SWDx->SWD_OperatingParameter.sys_call_s = SWDx_InitStruct->sys_call_s;
	SWDx->SWD_OperatingParameter.program_buffer = SWDx_InitStruct->program_buffer;
	SWDx->SWD_OperatingParameter.algo_start = SWDx_InitStruct->algo_start;
	SWDx->SWD_OperatingParameter.algo_size = SWDx_InitStruct->algo_size;
	SWDx->SWD_OperatingParameter.algo_blob = SWDx_InitStruct->algo_blob;
	SWDx->SWD_OperatingParameter.program_buffer_size = SWDx_InitStruct->program_buffer_size;
}
/**
  * @brief  恢复默认状态
  * @param 	SWDx.
  * @retval :void.
  */
void SWD_DeInit(SWD_TypeDef_Struct *SWDx)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	if(SWDx== NULL)  
		return;	

	if(SWDx == SWD1)
	{
		SWD1_BASE.SWD_Hardware.CLK_GPIOx = SWD1_CLKGPIOx;
		SWD1_BASE.SWD_Hardware.DIO_GPIOx = SWD1_DIOGPIOx;
		SWD1_BASE.SWD_Hardware.RST_GPIOx = SWD1_RSTGPIOx;
		SWD1_BASE.SWD_Hardware.CLK_GPIO_Pin = SWD1_CLKGPIO_Pin;
		SWD1_BASE.SWD_Hardware.DIO_GPIO_Pin = SWD1_DIOGPIO_Pin;
		SWD1_BASE.SWD_Hardware.RST_GPIO_Pin = SWD1_RSTGPIO_Pin;
	}
	else if(SWDx==SWD2)
	{
	  SWD2_BASE.SWD_Hardware.CLK_GPIOx = SWD2_CLKGPIOx;
		SWD2_BASE.SWD_Hardware.DIO_GPIOx = SWD2_DIOGPIOx;
		SWD2_BASE.SWD_Hardware.RST_GPIOx = SWD2_RSTGPIOx;
		SWD2_BASE.SWD_Hardware.CLK_GPIO_Pin = SWD2_CLKGPIO_Pin;
		SWD2_BASE.SWD_Hardware.DIO_GPIO_Pin = SWD2_DIOGPIO_Pin;
		SWD2_BASE.SWD_Hardware.RST_GPIO_Pin = SWD2_RSTGPIO_Pin;
	}	
	
	GPIO_InitStructure.Pin = SWDx->SWD_Hardware.CLK_GPIO_Pin;
	GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SWDx->SWD_Hardware.CLK_GPIOx, &GPIO_InitStructure);

	GPIO_InitStructure.Pin = SWDx->SWD_Hardware.DIO_GPIO_Pin;
	GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SWDx->SWD_Hardware.DIO_GPIOx, &GPIO_InitStructure);
	 
	GPIO_InitStructure.Pin = SWDx->SWD_Hardware.RST_GPIO_Pin;
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStructure.Pull = GPIO_NOPULL;
	GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	HAL_GPIO_Init(SWDx->SWD_Hardware.RST_GPIOx, &GPIO_InitStructure);
	
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.RST_GPIOx,SWDx->SWD_Hardware.RST_GPIO_Pin, GPIO_PIN_SET);
}


/**
  * @brief  读DIO 一个bit
  * @param 	SWDx.
  * @retval :1bit.
  */
uint32_t SWD_READ_BIT(SWD_TypeDef_Struct *SWDx)
{
	if(SWDx== NULL)  
		return 0;	
	uint32_t bit;
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.CLK_GPIOx,SWDx->SWD_Hardware.CLK_GPIO_Pin, GPIO_PIN_RESET);
	bit = HAL_GPIO_ReadPin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin);
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.CLK_GPIOx,SWDx->SWD_Hardware.CLK_GPIO_Pin, GPIO_PIN_SET);
	return bit;
}

/**
  * @brief  执行一个CLK周期
  * @param 	SWDx.
  * @retval :void.
  */
void SWD_CLOCK_CYCLE(SWD_TypeDef_Struct *SWDx)
{
	if(SWDx== NULL)  
			return;	
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.CLK_GPIOx,SWDx->SWD_Hardware.CLK_GPIO_Pin, GPIO_PIN_RESET);
	DELAY_US(1);
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.CLK_GPIOx,SWDx->SWD_Hardware.CLK_GPIO_Pin, GPIO_PIN_SET);
	DELAY_US(1);
}


/**
  * @brief  写DIO一个bit
  * @param 	SWDx.
  * @retval :void.
  */
void SWD_WRITE_BIT(SWD_TypeDef_Struct *SWDx,uint32_t bit)
{
	if(SWDx== NULL)  
			return;	
	if(bit & 0x01)
    HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
	else
		HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_RESET);
  SWD_CLOCK_CYCLE(SWDx);
}

/**
  * @brief  切换DIO为输入
  * @param 	SWDx.
  * @retval :void.
  */
void SWD_DIO_SET_INPUT(SWD_TypeDef_Struct *SWDx)
{
	 GPIO_InitTypeDef GPIO_InitStructure;

	  if(SWDx== NULL)  
			return;	
		GPIO_InitStructure.Pin = SWDx->SWD_Hardware.DIO_GPIO_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_INPUT;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(SWDx->SWD_Hardware.DIO_GPIOx, &GPIO_InitStructure);
}

/**
  * @brief  切换DIO为输出
  * @param 	SWDx.
  * @retval :void.
  */
void SWD_DIO_SET_OUTPUT(SWD_TypeDef_Struct *SWDx)
{
	 GPIO_InitTypeDef GPIO_InitStructure;

	  if(SWDx== NULL)  
			return;	
		GPIO_InitStructure.Pin = SWDx->SWD_Hardware.DIO_GPIO_Pin;
		GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
		GPIO_InitStructure.Pull = GPIO_NOPULL;
		GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(SWDx->SWD_Hardware.DIO_GPIOx, &GPIO_InitStructure);
}



/**
  * @brief  通信函数
  * @param 	SWDx.
  * @retval :void.
  */
uint8_t SWD_TransferOnce(SWD_TypeDef_Struct *SWDx,uint32_t request, uint32_t *data)
{
    uint32_t ack = 0;
    uint32_t bit;
    uint32_t val;
    uint32_t parity;

    uint32_t n;

    /* Packet Request */
    parity = 0;
    SWD_WRITE_BIT(SWDx,1);         /* Start Bit */
    bit = request & 0x1;
    SWD_WRITE_BIT(SWDx,bit);       /* APnDP Bit */
    parity += bit;
    bit = (request >> 1) & 0x1;
    SWD_WRITE_BIT(SWDx,bit);       /* RnW Bit */
    parity += bit;
    bit = request >> 2;
    SWD_WRITE_BIT(SWDx,bit);       /* A2 Bit */
    parity += bit;
    bit = request >> 3;
    SWD_WRITE_BIT(SWDx,bit);       /* A3 Bit */
    parity += bit;
    SWD_WRITE_BIT(SWDx,parity);    /* Parity Bit */
    SWD_WRITE_BIT(SWDx,0);         /* Stop Bit */
    SWD_WRITE_BIT(SWDx,1);         /* Park Bit */

    SWD_DIO_SET_INPUT(SWDx);

    /* Turnaround */
    for(n = 1; n; n--)
    {
        SWD_CLOCK_CYCLE(SWDx);
    }

