Ken930922/RT-Thread/applications/stm32f40x_SWD.c
    /* Acknowledge response */
    for(n = 0; n < 3; n++)
    {
        bit = SWD_READ_BIT(SWDx);
        ack  |= bit << n;
    }
    switch(ack)
    {
        case DAP_TRANSFER_OK:
            if(request & DAP_TRANSFER_RnW)  /* read data */
            {
                val = 0;
                parity = 0;

                for(n = 32; n; n--)
                {
                    bit = SWD_READ_BIT(SWDx);  /* Read RDATA[0:31] */
                    parity += bit;
                    val >>= 1;
                    val  |= bit << 31;
                }

                bit = SWD_READ_BIT(SWDx);    /* Read Parity */

                if((parity ^ bit) & 1)
                {
                    ack = DAP_TRANSFER_ERROR;
                }

                if(data) *data = val;

                /* Turnaround */
                for(n = 1; n; n--)
                {
                    SWD_CLOCK_CYCLE(SWDx);
                }

                SWD_DIO_SET_OUTPUT(SWDx);//SWDIO_SET_OUTPUT
            }
            else    /* write data */
            {
                /* Turnaround */
                for(n = 1; n; n--)
                {
                    SWD_CLOCK_CYCLE(SWDx);
                }

                SWD_DIO_SET_OUTPUT(SWDx);//SWDIO_SET_OUTPUT
                /* Write data */
                val = *data;
                parity = 0;

                for(n = 32; n; n--)
                {
                    SWD_WRITE_BIT(SWDx,val); /* Write WDATA[0:31] */
                    parity += val;
                    val >>= 1;
                }

                SWD_WRITE_BIT(SWDx,parity);/* Write Parity Bit */
            }

            /* Idle cycles */
            SWD_DIO_SET_OUTPUT(SWDx);
            HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
            for(n = 0; n < 8; n++)
            {
                SWD_WRITE_BIT(SWDx,0);
            }
            return (ack);

        case DAP_TRANSFER_WAIT:
        case DAP_TRANSFER_FAULT:

            /* WAIT or FAULT response */
            if(0 && ((request & DAP_TRANSFER_RnW) != 0))
            {
                for(n = 32 + 1; n; n--)
                {
                    SWD_CLOCK_CYCLE(SWDx);  /* Dummy Read RDATA[0:31] + Parity */
                }
            }

            /* Turnaround */
            for(n = 1; n; n--)
            {
                SWD_CLOCK_CYCLE(SWDx);
            }

            SWD_DIO_SET_OUTPUT(SWDx);

            if(0 && ((request & DAP_TRANSFER_RnW) == 0))
            {
                HAL_GPIO_WritePin(SWDx->SWD_Hardware.CLK_GPIOx,SWDx->SWD_Hardware.CLK_GPIO_Pin, GPIO_PIN_RESET);

                for(n = 32 + 1; n; n--)
                {
                    SWD_CLOCK_CYCLE(SWDx);  /* Dummy Write WDATA[0:31] + Parity */
                }
            }

            HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
            for(n = 0; n < 8; n++)
            {
                SWD_WRITE_BIT(SWDx,0);
            }
            return (ack);

        default:
            break;
    }

    /* Protocol error */
    for(n = 1 + 32 + 1; n; n--)
    {
        SWD_CLOCK_CYCLE(SWDx);      /* Back off data phase */
    }

    SWD_DIO_SET_OUTPUT(SWDx);
    HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
    for(n = 0; n < 8; n++)
    {
        SWD_WRITE_BIT(SWDx,0);
    }
    return (ack);
}


uint8_t SWD_Transfer(SWD_TypeDef_Struct *SWDx,uint32_t request, uint32_t *data)
{
    uint8_t i, ack;

    for(i = 0; i < 100; i++)
    {
        ack = SWD_TransferOnce(SWDx,request, data);
        // if ack != WAIT
        if(ack != DAP_TRANSFER_WAIT)
        {
            return ack;
        }
    }
    return ack;
}

/**
	* @brief  发送
  * @param 	SWDx.
  * @retval :void.
  */
void SWJ_SendData(SWD_TypeDef_Struct *SWDx,uint16_t data)
{
    uint8_t i;

    for(i = 0; i < 16; i++)
    {
        SWD_WRITE_BIT(SWDx,((data & 0x1) == 1) ? (1) : (0));
        data >>= 1;
    }
}

//-----------------------------------------------------------------------------
// SW_ShiftReset
//-----------------------------------------------------------------------------
//
// Puts the SWD into the reset state by clocking 64 times with SWDIO high.
// Leaves SWDIO an output and high.
//
void SWD_ShiftReset(SWD_TypeDef_Struct *SWDx)
{
    uint8_t i;
    // Drive SWDIO high
    SWD_DIO_SET_OUTPUT(SWDx);
    HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
    // Complete 64 SWCLK cycles
    for (i = 56; i != 0; i--)
    {
        SWD_CLOCK_CYCLE(SWDx);
    }
}


//JTAG切换到SWD
//1故障 0正常
uint8_t SWJ_JTAG2SWD(SWD_TypeDef_Struct *SWDx)
{
	uint8_t i;
	
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_SET);
		
	SWD_ShiftReset(SWDx);

	SWJ_SendData(SWDx,0xE79E);

	SWD_ShiftReset(SWDx);
	
	HAL_GPIO_WritePin(SWDx->SWD_Hardware.DIO_GPIOx,SWDx->SWD_Hardware.DIO_GPIO_Pin, GPIO_PIN_RESET);

	for(i = 0; i < 16; i++)
	{
			SWD_CLOCK_CYCLE(SWDx);
	}
	return 0;
}


//1故障 0正常
uint8_t SWJ_ReadDP(SWD_TypeDef_Struct *SWDx,uint8_t adr, uint32_t *val)
{
    uint32_t tmp_in;
    uint8_t ack;
    uint8_t err;

    tmp_in = SWD_REG_DP | SWD_REG_R | SWD_REG_ADR(adr);
    ack = SWD_Transfer(SWDx,tmp_in, val);

    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);
    return err;
}

//1故障 0正常
uint8_t SWJ_WriteDP(SWD_TypeDef_Struct *SWDx,uint8_t adr, uint32_t val)
{
    uint32_t req;
    uint8_t ack;
    uint8_t err;

    req = SWD_REG_DP | SWD_REG_W | SWD_REG_ADR(adr);
    ack = SWD_Transfer(SWDx,req, &val);

    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);
    return err;
}


/* Read access port register. */
//读AP寄存器
//1故障 0正常
uint8_t SWJ_ReadAP(SWD_TypeDef_Struct *SWDx,uint32_t adr, uint32_t *val)
{
    uint8_t tmp_in, ack, err;

    uint32_t apsel = adr & APSEL;
    uint32_t bank_sel = adr & APBANKSEL;

    if(SWJ_WriteDP(SWDx,DP_SELECT, apsel | bank_sel))
    {
        return 1;
    }

    tmp_in = SWD_REG_AP | SWD_REG_R | SWD_REG_ADR(adr);

    /* first dummy read */
    ack = SWD_Transfer(SWDx,tmp_in, val);
    ack = SWD_Transfer(SWDx,tmp_in, val);

    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);
    return err;
}

//写AP寄存器
//1故障 0正常

uint8_t SWJ_WriteAP(SWD_TypeDef_Struct *SWDx,uint32_t adr, uint32_t val)
{
    uint8_t req, ack, err;
//		uint32_t sas;
    uint32_t apsel = adr & APSEL;
    uint32_t bank_sel = adr & APBANKSEL;

