Ken930922/RT-Thread/applications/stm32f40x_SWD.c
    /* write DP select */
    if(SWJ_WriteDP(SWDx,DP_SELECT, apsel | bank_sel))
    {
			return 1;

    }
    /* write AP data */
    req = SWD_REG_AP | SWD_REG_W | SWD_REG_ADR(adr);
		ack = SWD_Transfer(SWDx,req, &val);

    /* read DP buff */
    req = SWD_REG_DP | SWD_REG_R | SWD_REG_ADR(DP_RDBUFF);
		ack = SWD_Transfer(SWDx,req, NULL);
//    ack = SWD_Transfer(req, &sas);
    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);

    return err;
}


/* Read 32-bit word from target memory. */
// AP CSW register, base value
#define CSW_VALUE (CSW_RESERVED | CSW_MSTRDBG | CSW_HPROT | CSW_DBGSTAT | CSW_SADDRINC)


// Write target memory.
//往目标内存写数据
//1故障 0正常
static uint8_t SWJ_WriteData(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint32_t data)
{
    static uint8_t req, ack, err;
		uint32_t val;
    SWJ_WriteAP(SWDx,AP_TAR, addr);

    /* write data */
    req = SWD_REG_AP | SWD_REG_W | AP_DRW;
    ack = SWD_Transfer(SWDx,req, &data);

    /* read DP buff */
    req = SWD_REG_DP | SWD_REG_R | SWD_REG_ADR(DP_RDBUFF);
    ack = SWD_Transfer(SWDx,req, &val);
	
	
    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);
    return err;
}
//往目标内存写数据u8
//1故障 0正常
static uint8_t SWJ_WriteMem8(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint8_t val)
{
    uint32_t tmp;
    uint8_t err;

		if (SWJ_WriteAP(SWDx,AP_CSW, CSW_VALUE | CSW_SIZE8)) 
		{
        return 1;
    }
    tmp = val << ((addr & 0x03) << 3);
    err = SWJ_WriteData(SWDx,addr, tmp);
    return err;
}
//往目标内存写数据u32
//1故障 0正常
uint8_t SWJ_WriteMem32(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint32_t val)
{
    uint8_t err;

    SWJ_WriteAP(SWDx,AP_CSW, CSW_VALUE | CSW_SIZE32);
    err = SWJ_WriteData(SWDx,addr, val);
    return err;
}

// Write 32-bit word aligned values to target memory using address auto-increment.
// size is in bytes.
//
//1故障 0正常
static uint8_t SWJ_WriteBlock(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint8_t *buf, uint32_t len)
{
    uint8_t req;
    uint32_t size_in_words;
    uint32_t i, ack;

    if(len == 0)  
			return 0;

    size_in_words = len / 4;

    if( SWJ_WriteAP(SWDx,AP_CSW, CSW_VALUE | CSW_SIZE32))
    {
				return 1;
    }
		if( SWJ_WriteAP(SWDx,AP_TAR, addr))
    {
        return 1;
    }

    /* DRW write */
    req = SWD_REG_AP | SWD_REG_W | (3 << 2);

    for(i = 0; i < size_in_words; i++)
    {
        if(SWD_Transfer(SWDx,req, (uint32_t *)buf) != DAP_TRANSFER_OK)
        {
            return 1;
        }

        buf += 4;
    }

    /* read DP buff */
    req = SWD_REG_DP | SWD_REG_R | SWD_REG_ADR(DP_RDBUFF);
    ack = SWD_Transfer(SWDx,req, NULL);

    if(ack == DAP_TRANSFER_OK) 
			return 0;
		else
			return 1;
}

// Read target memory.
//往目标内存读数据
//1故障 0正常
static uint8_t SWJ_ReadData(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint32_t *val)
{
    uint8_t req, ack, err;

    SWJ_WriteAP(SWDx,AP_TAR, addr);

    /* read data */
    req = SWD_REG_AP | SWD_REG_R | AP_DRW;
    ack = SWD_Transfer(SWDx,req, val);

    /* dummy read */
    req = SWD_REG_DP | SWD_REG_R | SWD_REG_ADR(DP_RDBUFF);
    ack = SWD_Transfer(SWDx,req, val);

    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);
    return err;
}
//往目标内存读数据u32
//1故障 0正常
static uint8_t SWJ_ReadMem32(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint32_t *val)
{
    uint8_t err;
    SWJ_WriteAP(SWDx,AP_CSW, CSW_VALUE | CSW_SIZE32);
    err = SWJ_ReadData(SWDx,addr, val);
    return err;
}
//往目标内存读数据u8
//1故障 0正常
static uint8_t SWJ_ReadMem8(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint8_t *val)
{
    uint32_t tmp;
    uint8_t err;

    SWJ_WriteAP(SWDx,AP_CSW, CSW_VALUE | CSW_SIZE8);

    err = SWJ_ReadData(SWDx,addr, &tmp);

    *val = (uint8_t)(tmp >> ((addr & 0x03) << 3));

    return err;
}

// Read 32-bit word aligned values from target memory using address auto-increment.
// size is in bytes.
//往目标内存读数据
//1故障 0正常
static uint8_t SWJ_ReadBlock(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint8_t *buf, uint32_t len)
{
    uint8_t err, req;
    uint32_t size_in_words;
    uint32_t i, ack;

    if(len == 0)  return 0;

    err = 0;
    size_in_words = len / 4;


    err += SWJ_WriteAP(SWDx,AP_CSW, CSW_VALUE | CSW_SIZE32);
    err += SWJ_WriteAP(SWDx,AP_TAR, addr);

    if(err) return err;

    req = SWD_REG_AP | SWD_REG_R | (3 << 2);

    /* dummy read */
    if(SWD_Transfer(SWDx,req, (uint32_t *)buf) != 0x01)
    {
        return 1;
    }

    for(i = 0; i < size_in_words; i++)
    {
        if(SWD_Transfer(SWDx,req, (uint32_t *)buf) != DAP_TRANSFER_OK)
        {
            return 1;
        }

        buf += 4;
    }

    /* read DP buff */
    req = SWD_REG_DP | SWD_REG_R | SWD_REG_ADR(DP_RDBUFF);
    ack = SWD_Transfer(SWDx,req, NULL);

    (ack == DAP_TRANSFER_OK) ? (err = 0) : (err = 1);
    return err;
}

#define TARGET_AUTO_INCREMENT_PAGE_SIZE    (0x400)

// Write unaligned data to target memory.
// size is in bytes.
//往目标内存写数据
//1故障 0正常
uint8_t swd_write_memory(SWD_TypeDef_Struct *SWDx,uint32_t address, uint8_t *data, uint32_t size)
{
    uint32_t n;

    // Write bytes until word aligned
    while((size > 0) && (address & 0x3))
    {
        if (SWJ_WriteMem8(SWDx,address, *data)) 
				{
            return 1;
        }
        address++;
        data++;
        size--;
    }

    // Write word aligned blocks
    while(size > 3)
    {
        // Limit to auto increment page size
        n = TARGET_AUTO_INCREMENT_PAGE_SIZE - (address & (TARGET_AUTO_INCREMENT_PAGE_SIZE - 1));

        if(size < n)
        {
            n = size & 0xFFFFFFFC; // Only count complete words remaining
        }

        if(SWJ_WriteBlock(SWDx,address, data, n))
        {
            return 1;
        }

        address += n;
        data += n;
        size -= n;
    }

    // Write remaining bytes
    while(size > 0)
    {
        SWJ_WriteMem8(SWDx,address, *data);

        address++;
        data++;
        size--;
    }

    return 0;
}

// Read unaligned data from target memory.
// size is in bytes.
//往目标内存读数据
//1故障 0正常
uint8_t swd_read_memory(SWD_TypeDef_Struct *SWDx,uint32_t address, uint8_t *data, uint32_t size)
{
    uint32_t n;

    // Read bytes until word aligned
    while((size > 0) && (address & 0x3))
    {
        SWJ_ReadMem8(SWDx,address, data);
        address++;
        data++;
        size--;
    }

    // Read word aligned blocks
    while(size > 3)
    {
        // Limit to auto increment page size
        n = TARGET_AUTO_INCREMENT_PAGE_SIZE - (address & (TARGET_AUTO_INCREMENT_PAGE_SIZE - 1));

        if(size < n)
        {
            n = size & 0xFFFFFFFC; // Only count complete words remaining
        }

        if(SWJ_ReadBlock(SWDx,address, data, n))
        {
            return 1;
        }

        address += n;
        data += n;
        size -= n;
    }

    // Read remaining bytes
    while(size > 0)
    {
        SWJ_ReadMem8(SWDx,address, data);
        address++;
        data++;
        size--;
    }

