Ken930922/RT-Thread/applications/stm32f40x_SWD.c
    return 0;
}
//往目标内存读数据
//1故障 0正常
uint8_t SWJ_ReadMem(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint8_t *buf, uint32_t len)
{
    return swd_read_memory(SWDx,addr, buf, len);
}
//往目标内存写数据
//1故障 0正常
uint8_t SWJ_WriteMem(SWD_TypeDef_Struct *SWDx,uint32_t addr, uint8_t *buf, uint32_t len)
{
    return swd_write_memory(SWDx,addr, buf, len);
}


//等目标Halt
//1故障 0正常
static uint8_t SWJ_WaitUntilHalted(SWD_TypeDef_Struct *SWDx)
{
    // Wait for target to stop
    uint32_t val, i, timeout = 1000000;

    for(i = 0; i < timeout; i++)
    {

        if(SWJ_ReadMem32(SWDx,DBG_HCSR, &val))
        {
            return 1;
        }

        if(val & S_HALT)
        {
            return 0;
        }
    }

    return DAP_TRANSFER_ERROR;
}

void swd_set_target_reset(SWD_TypeDef_Struct *SWDx,uint8_t asserted)
{
   if(asserted == 0)
	{
		SWJ_WriteMem32(SWDx,(uint32_t)&SCB->AIRCR, ((0x5FA << SCB_AIRCR_VECTKEY_Pos) |(SCB->AIRCR & SCB_AIRCR_PRIGROUP_Msk) | SCB_AIRCR_SYSRESETREQ_Msk));
	}
}

//设置目标复位状态
//1故障 0正常
uint8_t SWJ_SetTargetState(SWD_TypeDef_Struct *SWDx,TARGET_RESET_STATE state)
{
    uint32_t val;
    int8_t ap_retries = 2;
		if (state != RUN)
		{
			SWD_GPIOConfig(SWDx);
    }
		
    switch (state) 
		{
				case RESET_HOLD:
				{
					swd_set_target_reset(SWDx,1);
				}break;
				case RESET_RUN:
				{
					swd_set_target_reset(SWDx,1);
					DELAY_US(20 * 1000);
					swd_set_target_reset(SWDx,0);
					DELAY_US(20 * 1000);
					SWD_DeInit(SWDx);
				}break;
				case RESET_PROGRAM:
				{
					if (SWJ_InitDebug(SWDx)) 
					{
							return 1;
					}

					// Enable debug
					while(SWJ_WriteMem32(SWDx,DBG_HCSR, DBGKEY | C_DEBUGEN)) 
					{
							if( --ap_retries <=0 )
									return 1;
							// Target is in invalid state?
							swd_set_target_reset(SWDx,1);
							DELAY_US(20 * 1000);
							swd_set_target_reset(SWDx,0);
							DELAY_US(20 * 1000);
					}

					// Enable halt on reset
					if (SWJ_WriteMem32(SWDx,DBG_EMCR, VC_CORERESET)) 
					{
							return 1;
					}

					// Reset again
					swd_set_target_reset(SWDx,1);
					DELAY_US(20 * 1000);
					swd_set_target_reset(SWDx,0);
					DELAY_US(20 * 1000);

					do
					{
						if (SWJ_ReadMem32(SWDx,DBG_HCSR, &val)) 
						{
								return 1;
						}
					} while ((val & S_HALT) == 0);

					// Disable halt on reset
					if (SWJ_WriteMem32(SWDx,DBG_EMCR, 0))
					{
							return 1;
					}
				}break;
        case NO_DEBUG:
				{
					if (SWJ_WriteMem32(SWDx,DBG_HCSR, DBGKEY)) 
					{
							return 1;
					}
				}break;
        case DEBUG:
				{
					SWJ_JTAG2SWD(SWDx);
					
					if (SWJ_WriteDP(SWDx,DP_ABORT, STKCMPCLR | STKERRCLR | WDERRCLR | ORUNERRCLR)) 
					{
							return 1;
					}
					// Ensure CTRL/STAT register selected in DPBANKSEL
					if (SWJ_WriteDP(SWDx,DP_SELECT, 0)) {
							return 1;
					}
					// Power up
					if (SWJ_WriteDP(SWDx,DP_CTRL_STAT, CSYSPWRUPREQ | CDBGPWRUPREQ)) {
							return 1;
					}
					// Enable debug
					if (SWJ_WriteMem32(SWDx,DBG_HCSR, DBGKEY | C_DEBUGEN)) 
					{
							return 1;
					}
				}break;
        case HALT:
				{
					if (SWJ_InitDebug(SWDx)) 
					{
							return 1;
					}
					// Enable debug and halt the core (DHCSR <- 0xA05F0003)
					if (SWJ_WriteMem32(SWDx,DBG_HCSR, DBGKEY | C_DEBUGEN | C_HALT))
					{
							return 1;
					}
					// Wait until core is halted
					do {
						if (SWJ_ReadMem32(SWDx,DBG_HCSR, &val))
						{
								return 1;
						}
					} while ((val & S_HALT) == 0);
				}break;

        case RUN:
				{ 
					if (SWJ_WriteMem32(SWDx,DBG_HCSR, DBGKEY)) 
					{
             return 1;
          }
          SWD_DeInit(SWDx);
				}
        default:
            return 1;
    }

    return 0;
}

//写目标核寄存器
//1故障 0正常
static uint8_t SWJ_WriteCoreReg(SWD_TypeDef_Struct *SWDx,uint32_t n, uint32_t val)
{
    int i = 0, timeout = MAX_TIMEOUT;

    SWJ_WriteMem32(SWDx,DCRDR, val);

    SWJ_WriteMem32(SWDx,DCRSR, n | REGWnR);

    // wait for S_REGRDY
    for(i = 0; i < timeout; i++)
    {
        SWJ_ReadMem32(SWDx,DHCSR, &val);

        if(val & S_REGRDY)
        {
            return 0;
        }
    }

    return 1;
}
//读目标核寄存器
//1故障 0正常
static uint8_t SWJ_ReadCoreReg(SWD_TypeDef_Struct *SWDx,uint32_t n, uint32_t *val)
{
    int i = 0, timeout = MAX_TIMEOUT, err;

    if(SWJ_WriteMem32(SWDx,DCRSR, n))
        return 1;

    // wait for S_REGRDY
    for(i = 0; i < timeout; i++)
    {

        if(SWJ_ReadMem32(SWDx,DHCSR, val))
            return 1;

        if(*val & S_REGRDY)
            break;
    }

    if(i == timeout)
        return 1;

    err = SWJ_ReadMem32(SWDx,DCRDR, val);

    return err;
}
//写debug状态
typedef struct
{
    uint32_t r[16];
    uint32_t xpsr;
} DEBUG_STATE;
//1故障 0正常
uint8_t swd_write_debug_state(SWD_TypeDef_Struct *SWDx,DEBUG_STATE *state)
{
    uint32_t i, status;

    if(SWJ_WriteDP(SWDx,DP_SELECT, 0))
		{
       return 1;
    }
    // R0, R1, R2, R3
    for(i = 0; i < 4; i++)
    {
			if( SWJ_WriteCoreReg(SWDx,i, state->r[i]))
			{
				return 1;
			}
    }

    // R9
		if(SWJ_WriteCoreReg(SWDx,9, state->r[9]))
		{
			return 1;
		} 

    // R13, R14, R15
    for(i = 13; i < 16; i++)
    {
      if( SWJ_WriteCoreReg(SWDx,i, state->r[i]))
			{
				return 1;
			}
    }

    // xPSR
    if(SWJ_WriteCoreReg(SWDx,16, state->xpsr))
		{
			return 1;
		} 
		if( SWJ_WriteMem32(SWDx,DBG_HCSR, DBGKEY | C_DEBUGEN))
		{
			return 1;
		} 
    // check status
    
		if( SWJ_ReadDP(SWDx,DP_CTRL_STAT, &status))
		{
			return 1;
		}
		
    if(status & (STICKYERR | WDATAERR))
    {
        return 1;
    }

    return 0;
}

//flash状态回读????????????????????
//1故障 0正常
uint8_t swd_flash_syscall_exec(SWD_TypeDef_Struct *SWDx,const FLASH_SYSCALL *sysCallParam, uint32_t entry, uint32_t arg1, uint32_t arg2, uint32_t arg3, uint32_t arg4)
{
    DEBUG_STATE state = {{0}, 0};

    // Call flash algorithm function on target and wait for result.
    state.xpsr     = 0x01000000;          // xPSR: T = 1, ISR = 0
    state.r[0]     = arg1;                   // R0: Argument 1
    state.r[1]     = arg2;                   // R1: Argument 2
    state.r[2]     = arg3;                   // R2: Argument 3
    state.r[3]     = arg4;                   // R3: Argument 4
    state.r[9]     = sysCallParam->static_base;    // SB: Static Base
    state.r[13]    = sysCallParam->stack_pointer;  // SP: Stack Pointer
    state.r[14]    = sysCallParam->breakpoint;       // LR: Exit Point
    state.r[15]    = entry;                           // PC: Entry Point

    if(swd_write_debug_state(SWDx,&state))
    {
        return 1;
    }

    if(SWJ_WaitUntilHalted(SWDx))
    {
        return 1;
    }

    if(SWJ_ReadCoreReg(SWDx,0, &state.r[0]))
    {
        return 1;
    }


    // Flash functions return 0 if successful.
    if(state.r[0] != 0)
    {
        return 1;
    }

    return 0;
}

//将设备JTAG/SWD状态初始化
//1故障 0正常
uint8_t SWJ_InitDebug(SWD_TypeDef_Struct *SWDx)
{
		uint8_t i = 0;
    uint8_t timeout = 100;
    uint32_t tmp = 0;
    uint32_t val;
    /*JTAG 转到 SWD*/
		SWJ_JTAG2SWD(SWDx);

    if(SWJ_ReadDP(SWDx,DP_IDCODE, &val))
    {
        return 1;
    }
    //连接成功
		
		if(SWJ_WriteDP(SWDx,DP_ABORT, STKCMPCLR | STKERRCLR | WDERRCLR | ORUNERRCLR))
		{
        return 1;
    }
		/* Ensure CTRL/STAT register selected in DPBANKSEL */
    if (SWJ_WriteDP(SWDx,DP_SELECT, 0)) {
        return 1;
    }
    /* Power ups */
    if(SWJ_WriteDP(SWDx,DP_CTRL_STAT, CSYSPWRUPREQ | CDBGPWRUPREQ))
		{
			return 1;
		}
		/* Ensure CTRL/STAT register selected in DPBANKSEL */
		for (i = 0; i < timeout; i++) 
		{
			if (SWJ_ReadDP(SWDx,DP_CTRL_STAT, &tmp)) 
			{
					return 1;
			}
			if ((tmp & (CDBGPWRUPACK | CSYSPWRUPACK)) == (CDBGPWRUPACK | CSYSPWRUPACK)) 
			{
					// Break from loop if powerup is complete
					break;
			}
		}
    if (i == timeout) 
		{
        // Unable to powerup DP
        return 1;
    }
    if (SWJ_WriteDP(SWDx,DP_CTRL_STAT, CSYSPWRUPREQ | CDBGPWRUPREQ | TRNNORMAL | MASKLANE)) 
		{
        return 1;
    }
		
    return 0;
}

